///// DB에 저장이 되는 항목인 경우 CMB_CONST_XXXXX 의 형태로 CONST를 붙임.

CMB_STL_DGNTYPE_GIRDER                        = "Beam"
CMB_STL_DGNTYPE_COLUMN                        = "Column"
CMB_STL_DGNTYPE_BRACE                         = "Brace"

// Anchor Bolt Install Type
CMB_ANCBOLT_INSTYPE_CAST                      = "Cast-In-Place Anchor Bolt"
CMB_ANCBOLT_INSTYPE_POST                      = "Post-Installed Anchor Bolt"

// Anchor Bolt Type (Cast)
CMB_ANCBOLT_CAST_HEADED_STUD                  = "Headed Stud"
CMB_ANCBOLT_CAST_HEADED_BOLT                  = "Headed Bolt"
CMB_ANCBOLT_CAST_HOOKEDBOLTL                  = "Hooked Bolt-L"
CMB_ANCBOLT_CAST_HOOKEDBOLTJ                  = "Hooked Bolt-J"

// Anchor Bolt Type (Post)
CMB_ANCBOLT_POST_UNDERCUTANC                  = "Undercut Anchor"
CMB_ANCBOLT_POST_EXPANSIONTC                  = "Expansion Anchor ( Torque )"
CMB_ANCBOLT_POST_EXPANSIONDC                  = "Expansion Anchor ( Displacement )"
CMB_ANCBOLT_POST_ADHESIVEANC                  = "Adhesive Anchor"

// Steel Base Plate Shape
CMB_USBP_BASEPLATE_SHAPE_RECT                 = "Rectangle"
CMB_USBP_BASEPLATE_SHAPE_CIRC                 = "Circle"
CMB_USBP_PEDESTAL_SHAPE_RECT                  = "Rectangle"
CMB_USBP_PEDESTAL_SHAPE_CIRC                  = "Circle"
CMB_USBP_DISP_TYPE_SECT                       = "Section & Layout ( Plan + Elevation )"
CMB_USBP_DISP_TYPE_PLAN                       = "Section & Layout ( Plan Only )"
CMB_USBP_DISP_TYPE_ELEV                       = "Section & Layout ( Elevation Only )"
CMB_USBP_DISP_TYPE_BPMX                       = "BasePlate, Moment Diagram ( Mxx )"
CMB_USBP_DISP_TYPE_BPMY                       = "BasePlate, Moment Diagram ( Myy )"
CMB_USBP_DISP_TYPE_BPVX                       = "BasePlate, Shear Force Diagram ( Vxx )"
CMB_USBP_DISP_TYPE_BPVY                       = "BasePlate, Shear Force Diagram ( Vyy )"
CMB_USBP_DISP_TYPE_PLMU                       = "Rib/Wing Plate, Moment Diagram"
CMB_USBP_DISP_TYPE_PLVU                       = "Rib/Wing Plate, Shear Force Diagram"
CMB_USBP_DISP_TYPE_BEAR                       = "Bearing Force Diagram"
CMB_USBP_DISP_TYPE_TENS                       = "Tension Force of Anchor Bolt"

// EC3 Steel Base Plate
CMB_ESBP_DISP_TYPE_SECT                       = "Section & Layout ( Plan + Elevation )"
CMB_ESBP_DISP_TYPE_PLAN                       = "Section & Layout ( Plan Only )"
CMB_ESBP_DISP_TYPE_ELEV                       = "Section & Layout ( Elevation Only )"
CMB_ESBP_DISP_TYPE_BPMX                       = "BasePlate, Moment Diagram ( Mxx )"
CMB_ESBP_DISP_TYPE_BPMY                       = "BasePlate, Moment Diagram ( Myy )"
CMB_ESBP_DISP_TYPE_BPVX                       = "BasePlate, Shear Force Diagram ( Vxx )"
CMB_ESBP_DISP_TYPE_BPVY                       = "BasePlate, Shear Force Diagram ( Vyy )"
CMB_ESBP_DISP_TYPE_PLMU                       = "Rib/Wing Plate, Moment Diagram"
CMB_ESBP_DISP_TYPE_PLVU                       = "Rib/Wing Plate, Shear Force Diagram"
CMB_ESBP_DISP_TYPE_BEAR                       = "Bearing Force Diagram"
CMB_ESBP_DISP_TYPE_TENS                       = "Tension Force of Anchor Bolt"

// Steel Section Class
CMB_STL_SECT_CLASS_1                          = "Class-1"
CMB_STL_SECT_CLASS_2                          = "Class-2"
CMB_STL_SECT_CLASS_3                          = "Class-3"
CMB_STL_SECT_CLASS_4                          = "Class-4"

// Steel Stair Type
CMB_USST_STAIR_TYPE_A                         = "TYPE-A"
CMB_USST_STAIR_TYPE_B                         = "TYPE-B"
CMB_USST_DISP_TYPE_SECT                       = "Plan & Section"
CMB_USST_DISP_TYPE_BMMX                       = "Moment Diagram"
CMB_USST_DISP_TYPE_BMVX                       = "Shear Diagram"

// Steel Embedded Plate
CMB_USEP_DISP_TYPE_LAY_PE                     = "Layout ( Section + Elevation )"
CMB_USEP_DISP_TYPE_LAY_PL                     = "Layout ( Section Only )"
CMB_USEP_DISP_TYPE_LAY_EL                     = "Layout ( Elevation Only )"
CMB_USEP_DISP_TYPE_EP_MXX                     = "Embedded Plate Moment Diagram ( Mxx )"
CMB_USEP_DISP_TYPE_EP_MYY                     = "Embedded Plate Moment Diagram ( Myy )"
CMB_USEP_DISP_TYPE_EP_VXX                     = "Embedded Plate Shear Diagram ( Vxx )"
CMB_USEP_DISP_TYPE_EP_VYY                     = "Embedded Plate Shear Diagram ( Vyy )"
CMB_USEP_DISP_TYPE_RP_MXX                     = "Rib Plate Diagram ( Moment )"
CMB_USEP_DISP_TYPE_RP_VXX                     = "Rib Plate Diagram ( Shear )"
CMB_USEP_DISP_TYPE_BRNCOM                     = "Bearing Stress Diagram ( Compression )"
CMB_USEP_DISP_TYPE_BRNTEN                     = "Bearing Stress Diagram ( Tension )"

CMB_ESBC_CONN_TYPE_FIN_BTB                    = "Fin Plate - Beam to Beam"
CMB_ESBC_CONN_TYPE_FIN_BTC                    = "Fin Plate - Beam to Column"
CMB_ESBC_CONN_TYPE_END_BTB                    = "End Plate - Beam to Beam"
CMB_ESBC_CONN_TYPE_END_BTC                    = "End Plate - Beam to Column"
CMB_ESBC_CONN_TYPE_COL_BRN                    = "Column Splice - Bearing"
CMB_ESBC_SUPPORT_POSITION_FLG                 = "Flange"
CMB_ESBC_SUPPORT_POSITION_WEB                 = "Web"
CMB_ESBC_BOLT_TYPE_ORDINARY                   = "Ordinary"
CMB_ESBC_BOLT_TYPE_COUNTSNK                   = "Countersunk"
CMB_ESBC_FLG_PLATE_EXTERNAL                   = "External"
CMB_ESBC_FLG_PLATE_INTERNAL                   = "Internal"
CMB_ESBC_DEPTH_PART                           = "Partial"
CMB_ESBC_DEPTH_FULL                           = "Full"
CMB_ESBC_SUPPORTED_BEAM_NO_1                  = "1"
CMB_ESBC_SUPPORTED_BEAM_NO_2                  = "2"

CMB_USBC_CONN_TYPE_GIRDER_SPLICE              = "Girder Splice"
CMB_USBC_CONN_TYPE_COLUMN_SPLICE              = "Column Splice"
CMB_USBC_CONN_TYPE_SHEAR_CONNECT              = "Shear Connection"
CMB_USBC_SHEAR_CONNECT_TYPE_SINGLE            = "Single Shear"
CMB_USBC_SHEAR_CONNECT_TYPE_DOUBLE            = "Double Shear"
CMB_USBC_BOLT_RESIST_TYPE_SLIP                = "Slip-critical"
CMB_USBC_BOLT_RESIST_TYPE_BEAR                = "Bearing"
CMB_USBC_BOLT_HOLE_TYPE_STANDARD              = "Standard Bolt Holes"
CMB_USBC_BOLT_HOLE_TYPE_OVERSIZE              = "Oversized Bolt Holes"
CMB_USBC_BOLT_HOLE_TYPE_SHRTSLOT              = "Short-slotted Bolt Holes"
CMB_USBC_BOLT_HOLE_TYPE_LONGSLOT              = "Long-slotted Bolt Holes"
CMB_USBC_BOLT_HOLE_SIZE_TYPE_CENTER           = "Center to Center"
CMB_USBC_BOLT_HOLE_SIZE_TYPE_TANGNT           = "Tangent to Tangent"

CMB_USPG_MEMB_TYPE_PURLN                      = "Purlin"
CMB_USPG_MEMB_TYPE_GIRTH                      = "Girth"
CMB_USPG_SPAN_1SPAN                           = "1-Span"
CMB_USPG_SPAN_2SPAN                           = "2-Span"
CMB_USPG_SPAN_3SPAN                           = "3-Span"

CMB_USWO_BEAM_TYPE_COMPO_BEAM                 = "Composite Beam"
CMB_USWO_BEAM_TYPE_STEEL_BEAM                 = "Steel Beam"
CMB_USWO_OPENING_SHAPE_RECT                   = "Rectangle"
CMB_USWO_OPENING_SHAPE_CIRC                   = "Circle"

CMB_ESBC_BRACKET_TYPE_H                       = "H Section"
CMB_ESBC_BRACKET_TYPE_P                       = "Plate"
CMB_ESBC_WEB_STIF_TYPE_P                      = "Plate"
CMB_ESBC_WEB_STIF_TYPE_D                      = "Diagonal"
CMB_ESBC_WEB_STIF_TYPE_K                      = "K Shape"

CMB_ESMC_DISP_TYPE_TOTL                       = "Plan + Elevation + Side View"
CMB_ESMC_DISP_TYPE_PLAN                       = "Plan Only"
CMB_ESMC_DISP_TYPE_ELEV                       = "Elevation Only"
CMB_ESMC_DISP_TYPE_SIDE                       = "Side View Only"
CMB_ESMC_DISP_TYPE_FORC                       = "Bolt Force Diagram"

CMB_USMC_DISP_TYPE_TOTL                       = "Plan + Elevation + Side View"
CMB_USMC_DISP_TYPE_PLAN                       = "Plan Only"
CMB_USMC_DISP_TYPE_ELEV                       = "Elevation Only"
CMB_USMC_DISP_TYPE_SIDE                       = "Side View Only"

CMB_ESMC_REDU_FACT_TYPE_CALC                  = "Calculate by Program"
CMB_ESMC_REDU_FACT_TYPE_USER                  = "User Defined"

CMB_ESBP_DESIGN_METHOD_EAM                    = "Equivalent T-stub Method"
CMB_ESBP_DESIGN_METHOD_FEM                    = "Finite Element Method"

CMB_STBS_BRACE_TYPE_RELA_BRACE                = "Relative Bracing"
CMB_STBS_BRACE_TYPE_PONT_BRACE                = "Point Bracing"

CMB_USSG_COMB_RATIO_TYPE_SRSS                 = "Calculate by SRSS"
CMB_USSG_COMB_RATIO_TYPE_CODE                 = "Calculate by Code"

CMB_USWB_WEB_SHAPE_TRAP                       = "Trapezoidal"
CMB_USWB_WEB_SHAPE_SINE                       = "Sinusoidal"